code-examples/promjena-nacina-placanja-s-elektronickim-potpisom-912-zahtjev.xml

<?xml version="1.0" encoding="UTF-8"?>  
<soapenv:Envelope  xmlns:xd ="http://www.w3.org/2000/09/xmldsig# " xmlns:tns ="http://www.apis-
it.hr/fin/2012/types/f73 " xmlns:soapenv ="http://schemas.xmlsoap.org/soap/envelope/ "> 
<soapenv:Header /> 
<soapenv:Body> 
<tns:PromijeniNacPlacZahtjev  Id="promijeniNacPlac "> 
<tns:Zaglavlje> 
<tns:IdPoruke>863ce2af-cfc6-43ba-9acf-9d6e67ccff49 </tns:IdPoruke> 
<tns:DatumVrijeme>25.11.2021T11:11:09 </tns:DatumVrijeme> 
</tns:Zaglavlje> 
<tns:Racun> 
<tns:Oib>02994650199 </tns:Oib> 
<tns:USustPdv>true</tns:USustPdv> 
<tns:DatVrijeme>24.11.2021T13:11:04 </tns:DatVrijeme> 
<tns:OznSlijed>P</tns:OznSlijed> 
<tns:BrRac> 
<tns:BrOznRac>025559 </tns:BrOznRac> 
<tns:OznPosPr>POSL1</tns:OznPosPr> 
<tns:OznNapUr>12</tns:OznNapUr> 
</tns:BrRac> 
<tns:Pdv> 
<tns:Porez> 
<tns:Stopa>25.00</tns:Stopa> 
<tns:Osnovica>664.48 </tns:Osnovica> 
<tns:Iznos>166.12 </tns:Iznos> 
</tns:Porez> 
<tns:Porez> 
<tns:Stopa>13.00</tns:Stopa> 
<tns:Osnovica>434.62 </tns:Osnovica> 
<tns:Iznos>56.50</tns:Iznos> 
</tns:Porez> 
<tns:Porez> 
<tns:Stopa>0.00</tns:Stopa> 
<tns:Osnovica>187.08 </tns:Osnovica> 
<tns:Iznos>0.00</tns:Iznos> 
</tns:Porez> 
</tns:Pdv> 
<tns:Naknade> 
<tns:Naknada> 
<tns:NazivN>Povratna naknada </tns:NazivN> 
<tns:IznosN>2.11</tns:IznosN> 
</tns:Naknada> 
</tns:Naknade> 
<tns:IznosUkupno>1510.91 </tns:IznosUkupno> 
<tns:NacinPlac>C</tns:NacinPlac> 
<tns:OibOper>01234567890 </tns:OibOper> 
<tns:ZastKod>1b637899327fc1d4cf1fc3d5071a8c7c </tns:ZastKod> 
<tns:NakDost>false</tns:NakDost> 
<tns:PromijenjeniNacinPlac>K</tns:PromijenjeniNacinPlac> 
</tns:Racun> 
<Signature  xmlns="http://www.w3.org/2000/09/xmldsig# "> 
<SignedInfo> 
<CanonicalizationMethod  Algorithm ="http://www.w3.org/2001/10/xml-exc-c14n#"/> 
<SignatureMethod  Algorithm ="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/> 
<Reference  URI="#promijeniNacPlac "> 
<Transforms> 
<Transform  Algorithm ="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/> 
<Transform  Algorithm ="http://www.w3.org/2001/10/xml-exc-c14n#"/> 
</Transforms> 
<DigestMethod  Algorithm ="http://www.w3.org/2000/09/xmldsig#sha1"/> 
<DigestValue>J24GAC+TvttnYM4t+GQdNUBA/nU= </DigestValue> 
</Reference> 
</SignedInfo> 
<SignatureValue>Up7ZH8me0nAl7YGjzN++xohf2YAD/TyhWVl0avoHR5lMrm7Tajwgbxg1QN4lIgBrrxU6I7
ddi+5B 
mpaS9nWgBO9nGfP9v5S+pbfHuTZsCV3nknOVHJ39g/Qm9bkX+a7jAXOXkYyO4qi0b3zRm8JycNGt 
9+R6UW3YhXDWGYgKrVJEKJVMv0iDiUfHtMhCNqLbq5A5JRvvDpfRfGyjGlh1fVsjMD8wHtNgGvwW 
yPZ4VwKKj4H6nElPzZnymjSCX++iAarFmZGq2blJZaxvyYyXLOEzVX2+mDFRNpGcYmO4SfR60KOc 
eyvrB9HatZdVOSktsSH4fnMnluBr/lPnPx87mA== </SignatureValue> 
<KeyInfo> 
<X509Data> 
<X509Certificate>MIIGjzCCBHegAwIBAgIQVMN+ETtXRMMAAAAAXyRDJDANBgkqhkiG9w0BAQsFADBIMQ
swCQYDVQQG 
EwJIUjEdMBsGA1UEChMURmluYW5jaWpza2EgYWdlbmNpamExGjAYBgNVBAMTEUZpbmEgRGVtbyBD 
QSAyMDIwMB4XDTIxMTAxOTA4MjY1NloXDTI2MTAxOTA4MjY1NlowWDELMAkGA1UEBhMCSFIxJTAj 
BgNVBAoTHEFQSVMgSVQgRC5PLk8uIEhSMDI5OTQ2NTAxOTkxDzANBgNVBAcTBlpBR1JFQjERMA8G 
A1UEAxMIRklTS0FMIDMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCnVrIj9eExiFKX 
TB/t6eMBcb6IqzgmHMrJ6L5r5bUbcg7clP1OTfrOItMyUf2cVAl7B3gjS7rE1Y4LcnApYbx2Mzhf 
wi/ogmruJpdox32J8LG/1GmOW96Q9zJ/BlqLBrOBAmQ1i69QonilnbwQWi+XKqMRAqtNkJud6G44 
04kWiDgdXT6obZshJQaimG4dVd/bBxliGNKPg9nK6ZI2Ng4Vy075ajRe3bq8NseNhlCLB26UL1WS 
hkDNpGYTiN8K8Xyx7JFNpytC3ufS5PhPM8TLjJUYARrACC/CxHulWavJd4qVM/8ZYlORhJbBuc1d 
jjpyGsqVgYq5LED51jSCdV8XAgMBAAGjggJjMIICXzAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYw 
FAYIKwYBBQUHAwQGCCsGAQUFBwMCMIGsBgNVHSAEgaQwgaEwgZQGCSt8iFAFIQ8DATCBhjBBBggr 
BgEFBQcCARY1aHR0cDovL2RlbW8tcGtpLmZpbmEuaHIvY3BzL2Nwc25xY2RlbW8yMDE0djItMC1o 
ci5wZGYwQQYIKwYBBQUHAgEWNWh0dHA6Ly9kZW1vLXBraS5maW5hLmhyL2Nwcy9jcHNucWNkZW1v 
MjAxNHYyLTAtZW4ucGRmMAgGBgQAj3oBATB9BggrBgEFBQcBAQRxMG8wKAYIKwYBBQUHMAGGHGh0 
dHA6Ly9kZW1vMjAxNC1vY3NwLmZpbmEuaHIwQwYIKwYBBQUHMAKGN2h0dHA6Ly9kZW1vLXBraS5m 
aW5hLmhyL2NlcnRpZmlrYXRpL2RlbW8yMDIwX3N1Yl9jYS5jZXIwgbQGA1UdHwSBrDCBqTCBpqCB 
o6CBoIYoaHR0cDovL2RlbW8tcGtpLmZpbmEuaHIvY3JsL2RlbW8yMDIwLmNybIZ0bGRhcDovL2Rl 
bW8tbGRhcC5maW5hLmhyL2NuPUZpbmElMjBEZW1vJTIwQ0ElMjAyMDIwLG89RmluYW5jaWpza2El 
MjBhZ2VuY2lqYSxjPUhSP2NlcnRpZmljYXRlUmV2b2NhdGlvbkxpc3QlM0JiaW5hcnkwHwYDVR0j 
BBgwFoAUla9S1cLp1zeEPm5Jj8kf6lwrX88wHQYDVR0OBBYEFHbh5aGV7SnN828H+8jZ/1kRMgkm 
MAkGA1UdEwQCMAAwDQYJKoZIhvcNAQELBQADggIBAGZLzwPNAnhYAESsDRLdnZ/7a7uoKLOTh0hN 
UgqESGOkB8xcuQFHHKLwQlmFdv+/2i3WPT4aXg0PNPFIlNLABIlnZEJfhpAsnswCBcZfBMTFqmOU 
lJkQIghSSVHm7yC2eJBiB9x/PnZQzd2FteHOprT5exd2wvHIhQEtmLDpI+hDNv6zvBxrRcz6aT4v 
5KfmkP5O4z1jj5y4Ug5Su7TX2KpT/zRNPPPQXsqg+dS+6C+FJFG7UFRHEMSvAc2BFDm+T8UXUIXE 
61jSOj/Dw1g2mSSdJFLNrB8T0hWaj7EX32sEd0KGQJmBsK4hMiUmV96ZmJFcJksiuwPcAbXLdvJt 
8R6T9KuVsxMBKt7QVYFd723o2hiPTCbc/2LrwAIpAIsinlOi238SyNvVqvsuRVe8EWKZo+KV9JZ9 
IQksz/vXNehGt/f4NCfGqZZiWndbp1DewISSLifqlKyGzghC49jwUu03HD86RRFYw6l6BNf0s9s2 
YyppEndTCJWruaX+YYEYxulVBY0E4hohidwWBCGg4wWKWEUYBnHuzaSTEzx6KQUZtRoxuISPGujE 
6fwb4oSExQ3FcURRszb+kwajXiptZk1kJrbF5GBYeGq74mFRth+pRaoEWWdGzz38Az6GXD+dg9Fh 
qCvj6Z5PzH80VoVso9YQVauOWavRdfIgDIxLenNx </X509Certificate> 
<X509IssuerSerial> 
<X509IssuerName>CN=Fina Demo CA 2020,O=Financijska agencija,C=HR </X509IssuerName> 
<X509SerialNumber>112670206482201164408252157595450884900 </X509SerialNumber> 
</X509IssuerSerial> 
</X509Data> 
</KeyInfo> 
</Signature> 
</tns:PromijeniNacPlacZahtjev> 
</soapenv:Body> 
</soapenv:Envelope>